modm-ext/data.modm.io/docs/svd/header_stm32f779xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MDIOS</name>
      <description>MDIOS</description>
      <groupName>MDIOS</groupName>
      <baseAddress>0x40017800</baseAddress>
      <interrupt>
        <name>MDIOS</name>
        <description>MDIO Slave global Interrupt</description>
        <value>109</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>MDIOS Configuration Register (MDIOS_CR)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Peripheral enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRIE</name>
              <description>Register write interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDIE</name>
              <description>Register Read Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIE</name>
              <description>Error interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPC</name>
              <description>Disable Preamble Check</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PORT_ADDRESS</name>
              <description>PORT_ADDRESS[4:0] bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRFR</name>
          <description>MDIOS Configuration Register (MDIOS_CR)</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WRF</name>
              <description>WRF[31:0] bits (Write flags for MDIO register 0 to 31)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CWRFR</name>
          <description>MDIOS Configuration Register (MDIOS_CR)</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CWRF</name>
              <description>CWRF[31:0] bits (Clear the write flag for MDIO register 0 to 31)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDFR</name>
          <description>MDIOS Configuration Register (MDIOS_CR)</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RDF</name>
              <description>RDF[31:0] bits (Read flags for MDIO registers 0 to 31)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRDFR</name>
          <description>MDIOS Configuration Register (MDIOS_CR)</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRDF</name>
              <description>CRDF[31:0] bits (Clear the read flag for MDIO registers 0 to 31)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>MDIOS Configuration Register (MDIOS_CR)</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PERF</name>
              <description>Preamble error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERF</name>
              <description>Start error flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERF</name>
              <description>Turnaround error flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLRFR</name>
          <description>MDIOS Configuration Register (MDIOS_CR)</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CPERF</name>
              <description>Clear the preamble error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSERF</name>
              <description>Clear the start error flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTERF</name>
              <description>Clear the turnaround error flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DINR0</name>
          <description>MDIOS Input Data Register (MDIOS_DINR0)</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR1</name>
          <description>MDIOS Input Data Register (MDIOS_DINR1)</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR2</name>
          <description>MDIOS Input Data Register (MDIOS_DINR2)</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR3</name>
          <description>MDIOS Input Data Register (MDIOS_DINR3)</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR4</name>
          <description>MDIOS Input Data Register (MDIOS_DINR4)</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR5</name>
          <description>MDIOS Input Data Register (MDIOS_DINR5)</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR6</name>
          <description>MDIOS Input Data Register (MDIOS_DINR6)</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR7</name>
          <description>MDIOS Input Data Register (MDIOS_DINR7)</description>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR8</name>
          <description>MDIOS Input Data Register (MDIOS_DINR8)</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR9</name>
          <description>MDIOS Input Data Register (MDIOS_DINR9)</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR10</name>
          <description>MDIOS Input Data Register (MDIOS_DINR10)</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR11</name>
          <description>MDIOS Input Data Register (MDIOS_DINR11)</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR12</name>
          <description>MDIOS Input Data Register (MDIOS_DINR12)</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR13</name>
          <description>MDIOS Input Data Register (MDIOS_DINR13)</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR14</name>
          <description>MDIOS Input Data Register (MDIOS_DINR14)</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR15</name>
          <description>MDIOS Input Data Register (MDIOS_DINR15)</description>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR16</name>
          <description>MDIOS Input Data Register (MDIOS_DINR16)</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR17</name>
          <description>MDIOS Input Data Register (MDIOS_DINR17)</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR18</name>
          <description>MDIOS Input Data Register (MDIOS_DINR18)</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR19</name>
          <description>MDIOS Input Data Register (MDIOS_DINR19)</description>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR20</name>
          <description>MDIOS Input Data Register (MDIOS_DINR20)</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR21</name>
          <description>MDIOS Input Data Register (MDIOS_DINR21)</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR22</name>
          <description>MDIOS Input Data Register (MDIOS_DINR22)</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR23</name>
          <description>MDIOS Input Data Register (MDIOS_DINR23)</description>
          <addressOffset>0x15c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR24</name>
          <description>MDIOS Input Data Register (MDIOS_DINR24)</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR25</name>
          <description>MDIOS Input Data Register (MDIOS_DINR25)</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR26</name>
          <description>MDIOS Input Data Register (MDIOS_DINR26)</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR27</name>
          <description>MDIOS Input Data Register (MDIOS_DINR27)</description>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR28</name>
          <description>MDIOS Input Data Register (MDIOS_DINR28)</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR29</name>
          <description>MDIOS Input Data Register (MDIOS_DINR29)</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR30</name>
          <description>MDIOS Input Data Register (MDIOS_DINR30)</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DINR31</name>
          <description>MDIOS Input Data Register (MDIOS_DINR31)</description>
          <addressOffset>0x17c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR0</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR0)</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR1</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR1)</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR2</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR2)</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR3</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR3)</description>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR4</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR4)</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR5</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR5)</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR6</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR6)</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR7</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR7)</description>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR8</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR8)</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR9</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR9)</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR10</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR10)</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR11</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR11)</description>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR12</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR12)</description>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR13</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR13)</description>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR14</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR14)</description>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR15</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR15)</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR16</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR16)</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR17</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR17)</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR18</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR18)</description>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR19</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR19)</description>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR20</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR20)</description>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR21</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR21)</description>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR22</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR22)</description>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR23</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR23)</description>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR24</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR24)</description>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR25</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR25)</description>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR26</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR26)</description>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR27</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR27)</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR28</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR28)</description>
          <addressOffset>0x1f0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR29</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR29)</description>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR30</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR30)</description>
          <addressOffset>0x1f8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DOUTR31</name>
          <description>MDIOS Output Data Register (MDIOS_DOUTR31)</description>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
